/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tmuramat <tmuramat@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/22 08:59:01 by tmuramat          #+#    #+#             */
/*   Updated: 2022/12/22 08:59:03 by tmuramat         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

/**
 ***************************************************************
 *	function: main
 *
 * @params[argc] コマンドライン引数の数
 * @params[argv] コマンドライン引数の配列
 * @params[envp] 環境変数へのポインタ
 ***************************************************************
*/
int	main(int argc, char **argv, char **envp)
{
	(void)argc;
	(void)argv;
	init_envs(envp);
	put_banner();
	boot_minishell(envp);
	return (0);
}
